INSERT INTO USERS (name, email, password)
VALUES ('User', 'user@yandex.ru', '{noop}password'),
       ('Admin', 'admin@gmail.com', '{noop}admin'),
       ('User1', 'user1@yandex.ru', '{noop}password1'),
       ('User2', 'user2@yandex.ru', '{noop}password2'),
       ('User3', 'user3@yandex.ru', '{noop}password3'),
       ('User4', 'user4@yandex.ru', '{noop}password4'),
       ('User5', 'user5@yandex.ru', '{noop}password5');

INSERT INTO USER_ROLES (role, user_id)
VALUES ('USER', 1),
       ('ADMIN', 2),
       ('USER', 2),
       ('USER', 3),
       ('USER', 4),
       ('USER', 5),
       ('USER', 6),
       ('USER', 7);

INSERT INTO RESTAURANT(name, country, district, locality, street, number)
VALUES ('Семейный', 'Россия', 'Пермский край', 'Пермь', 'Ленина', 30),
       ('Georgia', 'Россия', 'Пермский край', 'Пермь', 'Орджоникидзе', 18),
       ('Одесса', 'Россия', 'Пермский край', 'Пермь', 'Белинского', 25),
       ('Облака', 'Россия', 'Пермский край', 'Пермь', 'Екатерининская', 120);


INSERT INTO DISH(name, serving, price, restaurant_id)
VALUES ('Форель жаренная', '2022-04-20', 14500, 1),
       ('Морская мелодия', '2022-04-20', 12000, 2),
       ('Стейк', '2022-04-20', 35000, 3),
       ('Лагман', '2022-04-20', 4400, 4),
       ('Плов', '2022-04-20', 52000, 1),
       ('Пельмени', '2022-04-20', 56900, 2),
       ('Гуляш венгерский', '2022-04-20', 78000, 3),
       ('Паста с баклажанами', '2022-04-20', 10000, 4),
       ('Пицца', '2022-04-20', 18000, 1),
       ('Салат Цезарь', '2022-04-20', 25000, 2),
       ('Борщ', '2022-04-20', 36000, 3),
       ('Мясо в жаровне', '2022-04-20', 46000, 4),
       ('Шурпа', '2022-04-20', 16900, 1),
       ('Утка по-пекински', '2022-04-20', 78000, 2),
    /*2-th part*/
       ('Сёмга запеченная', '2022-04-21', 14500, 1),
       ('Оливье', '2022-04-21', 12000, 2),
       ('Цезарь', '2022-04-21', 35000, 3),
       ('Солянка', '2022-04-21', 4400, 4),
       ('Азу', '2022-04-21', 52000, 1),
       ('Бешбармак', '2022-04-21', 56900, 2),
       ('Пряный баклажан на гриле', '2022-04-21', 78000, 3),
       ('Бургер с трюфелем', '2022-04-21', 10000, 4),
       ('Стейк из форели', '2022-04-21', 18000, 1),
       ('Салат Столичный', '2022-04-21', 25000, 2),
       ('Уха', '2022-04-21', 36000, 3),
       ('Соте', '2022-04-21', 46000, 4),
       ('Ризотто', '2022-04-21', 16900, 1),
       ('Царское блюдо', '2022-04-21', 78000, 2),
    /*3-th part*/
       ('Оленина', now(), 59879, 1),
       ('Жаркое', now(), 15989, 2),
       ('Хаш', now(), 36412, 3),
       ('Баранина', now(), 78954, 4),
       ('Курник', now(), 78789, 1),
       ('Омлет', now(), 13698, 2);

INSERT INTO VOTE(vote_date, restaurant_id, user_id)
VALUES ('2022-04-20', 1, 1),
       ('2022-04-20', 4, 2),
       ('2022-04-20', 3, 3),
       ('2022-04-20', 1, 4),
       ('2022-04-20', 1, 5),
       ('2022-04-20', 1, 6),
       ('2022-04-20', 2, 7),
       ('2022-04-21', 1, 1),
       ('2022-04-21', 4, 2),
       ('2022-04-21', 3, 3),
       ('2022-04-21', 1, 4),
       ('2022-04-21', 1, 5),
       ('2022-04-21', 1, 6),
       ('2022-04-21', 2, 7),
       (now(), 1, 1);
