INSERT INTO USERS (name, email, password)
VALUES ('User', 'user@yandex.ru', '{noop}password'),
       ('Admin', 'admin@gmail.com', '{noop}admin');

INSERT INTO USER_ROLES (role, user_id)
VALUES ('USER', 1),
       ('ADMIN', 2),
       ('USER', 2);

INSERT INTO RESTAURANT(name, country, district, locality, street, number)
VALUES ('Семейный', 'Россия', 'Пермский край', 'Пермь', 'Ленина', 30),
       ('Georgia', 'Россия', 'Пермский край', 'Пермь', 'Орджоникидзе', 18),
       ('Одесса', 'Россия', 'Пермский край', 'Пермь', 'Белинского', 25),
       ('Облака', 'Россия', 'Пермский край', 'Пермь', 'Екатерининская', 120);


INSERT INTO DISH(name, serving, price, restaurant_id)
VALUES ('Форель жаренная', '2022-04-20', 14500, 1),
       ('Морская мелодия', '2022-04-20', 12000, 2),
       ('Стейк', '2022-04-20', 35000, 3),
       ('Лагман', '2022-04-20', 4400, 4),
       ('Плов', '2022-04-20', 52000, 1),
       ('Пельмени', '2022-04-20', 56900, 2),
       ('Гуляш венгерский', '2022-04-20', 78000, 3),
       ('Паста с баклажанами', '2022-04-20', 10000, 4),
       ('Пицца', '2022-04-20', 18000, 1),
       ('Салат Цезарь', '2022-04-20', 25000, 2),
       ('Борщ', '2022-04-20', 36000, 3),
       ('Мясо в жаровне', '2022-04-20', 46000, 4),
       ('Шурпа', '2022-04-20', 16900, 1),
       ('Утка по-пекински', '2022-04-20', 78000, 2);

